/**
 * @license
 * SPDX-License-Identifier: Apache-2.0
 */

import { Customer } from "./types";

export const CSV_URL = "https://docs.google.com/spreadsheets/d/e/2PACX-1vQjZAavLs3qjRi2nF3YTdJYFxfGL3R4spOp3wn9jSm3TLqeq_nJkRSVsOD_uS0lE7t20Ztie9YWu_wU/pub?gid=598252857&single=true&output=csv";

export const PROMOTIONS = {
  "จองโปร": [
    "1. ส่วนลดค่าผ้าทุกรายการ 30%",
    "1.1 พิเศษ! ส่วนลดค่าผ้า Energy Saving และ Dim Out 40% (ยกเว้นรุ่น Ultra Violet และ Ballet)",
    "1.2 พิเศษ! ส่วนลดค่าผ้า Black Out เฉพาะรุ่น Cater และ Absolute 50%",
    "2. ส่วนลดค่าตัดเย็บและอุปกรณ์รางม่าน 30%",
    "3. รับส่วนลด Ontop เมื่อยอดสั่งทำผ้าม่านครบตาม Tier (มูลค่าของยอดหลังหักส่วนลดตามข้อ 1 และ 2 แล้ว)",
    "3.1 รับส่วนลด Ontop 7% เมื่อสั่งทำผ้าม่านมูลค่า 30,000 บาท ขึ้นไป",
    "3.2 รับส่วนลด Ontop 10% เมื่อสั่งทำผ้าม่านมูลค่า 70,000 บาท ขึ้นไป",
    "3.3 รับส่วนลด Ontop 13% เมื่อสั่งทำผ้าม่านมูลค่า 120,000 บาท ขึ้นไป",
    "4. ฟรี! ค่าบริการติดตั้งพื้นฐาน เมื่อสั่งทำผ้าม่านมูลค่า 20,000 บาท ขึ้นไป (มูลค่าของยอดหลังหักส่วนลดทุกอย่างแล้วและเฉพาะพื้นที่ติดตั้งในเขตกรุงเทพฯและปริมณฑลเท่านั้น)",
    "5. ต้องติดตั้งภายใน 6 เดือน นับจากวันสุดท้ายของงานอีเว้นท์นี้"
  ],
  "จองโปรพร้อมมอเตอร์": [
    "1. ส่วนลดค่าผ้าทุกรายการ 30%",
    "1.1 พิเศษ! ส่วนลดค่าผ้า Energy Saving และ Dim Out 40% (ยกเว้นรุ่น Ultra Violet และ Ballet)",
    "1.2 พิเศษ! ส่วนลดค่าผ้า Black Out เฉพาะรุ่น Cater และ Absolute 50%",
    "2. ส่วนลดค่าตัดเย็บและอุปกรณ์รางม่าน 30%",
    "3. รับส่วนลด Ontop เมื่อยอดสั่งทำผ้าม่านครบตาม Tier (มูลค่าของยอดหลังหักส่วนลดตามข้อ 1 และ 2 แล้ว)",
    "3.1 รับส่วนลด Ontop 7% เมื่อสั่งทำผ้าม่านมูลค่า 30,000 บาท ขึ้นไป",
    "3.2 รับส่วนลด Ontop 10% เมื่อสั่งทำผ้าม่านมูลค่า 70,000 บาท ขึ้นไป",
    "3.3 รับส่วนลด Ontop 13% เมื่อสั่งทำผ้าม่านมูลค่า 120,000 บาท ขึ้นไป",
    "4. ฟรี! ค่าบริการติดตั้งพื้นฐาน เมื่อสั่งทำผ้าม่านมูลค่า 20,000 บาท ขึ้นไป (มูลค่าของยอดหลังหักส่วนลดทุกอย่างแล้วและเฉพาะพื้นที่ติดตั้งในเขตกรุงเทพฯและปริมณฑลเท่านั้น)",
    "5. พิเศษ! ส่วนลดค่ามอเตอร์ SOMFY เฉพาะรุ่น DESINGO 35/50 RTS 50% (ไม่ร่วมรายการส่วนลด Ontop)",
    "6. ต้องติดตั้งภายใน 6 เดือน นับจากวันสุดท้ายของงานอีเว้นท์นี้"
  ]
};

export const FALLBACK_CUSTOMERS: Customer[] = [
  {
    date: "20/06/2026",
    name: "คุณ ชุตินันท์ สิทธิพงศ์",
    phone: "081-765-4321",
    cleanPhone: "0817654321",
    amount: "5,000",
    promoRaw: "1. โปรโมชั่นส่วนลด จองสิทธิ์โปรโมชั่นผ้าม่าน",
    promoType: "จองโปร",
    salesperson: "น้องส้มส้ม PASAYA"
  },
  {
    date: "21/06/2026",
    name: "คุณ พงศกร วรเวชกุล",
    phone: "095-123-4567",
    cleanPhone: "0951234567",
    amount: "10,000",
    promoRaw: "2. โปรโมชั่นส่วนลด จองสิทธิ์มัดจำโปรผ้าม่าน พร้อมมอเตอร์ Somfy 50%",
    promoType: "จองโปรพร้อมมอเตอร์",
    salesperson: "น้องต้อม PASAYA"
  },
  {
    date: "22/06/2026",
    name: "คุณ วราพร สินค้านำไทย",
    phone: "088-999-8888",
    cleanPhone: "0889998888",
    amount: "5,000",
    promoRaw: "1. โปรโมชั่นส่วนลด จองสิทธิ์โปรโมชั่นผ้าม่าน",
    promoType: "จองโปร",
    salesperson: "น้องส้มส้ม PASAYA"
  }
];
